[
    "Без холивара «переписать все на Go»: проблема переносимости в Python и ее решение",
    "Погружение в метаклассы в Python",
    "Тестирование алгоритма деления больших чисел на С++ с использованием Python C API",
    "Декораторы Python: пошаговое руководство",
    "Mojo: убийца Python и будущее AI",
    "Основы индексации и срезов в Python",
    "Python-праздник на Positive Hack Days Fest 2",
    "Разными способами пишем игру «Камень-ножницы-бумага» на Python",
    "Веб-скрапинг с Scrapy на Python",
    "YandexGPT API быстро и без труда с Python SDK. Делимся опытом интеграции",
    "Python — Дескрипторы (Descriptors)",
    "От кода до сертификата: Создание веб-приложения на Python Flask для автоматизации выдачи сертификатов",
    "Async iterator timeout в Python",
    "Курс «Python для инженеров». Старт 3 потока 31 января",
    "Жаждущим автоматизации: открытый урок «ChatOps c Errbot на Python», 21 декабря",
    "Открытый урок «Пишем Custom Prometheus Exporter на Python», 19 января",
    "Python Community Meetup 8/07: видео и материалы встречи",
    "Вышел Python 2.7.18, последний релиз ветки Python 2.x",
    "Когда достаточно простого класса Python — взять и начать управлять ML-экспериментами",
    "EPAM разработала бесплатный курс по программированию для детей и подростков «Chatbot on Python. Part 1»",
    "Python как компилируемый статически типизированный язык программирования",
    "Вышел мартовский релиз расширения Python для Visual Studio Code",
    "Microsoft представила дополнение Python Editor от команды Excel Labs",
    "Alchemer совместно с JetBrains и Python Software Foundation запустила «Опрос Python-разработчиков 2023»",
    "Вышел язык программирования Python 3.10.0",
    "В начале этого года Python сместил Java и стал вторым по популярности языком программирования среди разработчиков",
    "Microsoft добавила Python в Excel",
    "Вышел Python 3.11",
    "Вышла версия 0.0.2 snakeware — дистрибутива Linux, в котором всё работает через Python",
    "Создатель Python Гвидо ван Россум выходит на работу в Microsoft",
    "Автор курсов по Python и Pandas жалуется на вечный бан за рекламу торговли экзотическими животными",
    "JetBrains и Python Software Foundation рассказали, как разработчики использовали Python в 2022 году",
    "Три уровня погружения в Python. Запись докладов с Python Meetup и полезные материалы",
    "Positive Technologies открыла доступ по запросу к сервису обнаружения вредоносных Python-пакетов PT PyAnalysis",
    "Moscow Python Meetup x YADRO: встречаемся 23 марта",
    "Класс Reverse Mapping на Python",
    "Создание генетического алгоритма для нейросети и нейроcети для графических игр с помощью Python и NumPy",
    "Решение головоломки из университетского квеста с помощью Python",
    "Майним крипту и NFT с помощью Python",
    "Осталась неделя до старта 4 потока Python для инженеров",
    "Python вышел на первое место рейтинга TIOBE, и Гвидо высказался на эту тему",
    "Вышла первая бета-версия языка программирования Python 3.13.0b1",
    "Создатель Python Гвидо ван Россум ушел из Dropbox на пенсию",
    "Исследование: ChatGPT работает лучше на Julia, чем на Python и R",
    "«Тестирование веб-приложений на Python» — новый навыковый курс от Яндекс Практикума",
    "Как стать Python-разработчиком: сессия вопросов и ответов",
    "Python или Golang: что учить в 2023?",
    "Астрономам порекомендовали меньше использовать суперкомпьютеры и Python из-за вреда экологии",
    "Разработчик предложил устроить коммунистическую революцию в Python, объединив все классы и сделать их равными",
    "24 марта Слёрм проведёт открытый урок «Первый код на Python»",
    "Приложение Tinkerstellar для обучения Python на iPad получило поддержку iPhone",
    "Есть ли будущее у Python? Обсудим в этот четверг",
    "Слёрм запускает 3-дневный интенсив по Python для инженеров и разработчиков",
    "Python, SQL, С и Java стали самыми популярными языками программирования в ежегодном рейтинге IEEE Spectrum",
    "Юбилейный поток Python для инженеров",
    "Присоединяйтесь к обсуждению фреймворков и архитектуры в Python",
    "Яндекс Практикум запустил буткемп «Python-разработчик»",
    "3-месячный курс по Python",
    "«Python-разработка для начинающих» — бесплатный курс с разработкой планировщика задач и Telegram-бота",
    "TechnoMeetsPython. Онлайн митап о Python-разработке",
    "Дайджест Слёрма: тест на уровень кунг-фу по Python, свежие статьи и акции",
    "Интенсив для повышения квалификации: как использовать Python для анализа данных",
    "Последний поток Python для инженеров в этом году",
    "Асинхронное программирование на Python для джуниор-разработчиков, 4-й поток",
    "В Visual Studio Code добавили новые возможности для работы с Python",
    "Асинхронное программирование на Python для джуниор-разработчиков",
    "Углубляемся в Python на Evrone meetup",
    "А теперь нечто совсем иное! Митап «Типичный Python»",
    "Теория и практика Python meetup от Evrone",
    "«Разработчикам вход запрещен» или курс «Python для инженеров инфраструктуры»",
    "Что нового в Python за июль — обсуждаем в прямом эфире",
    "В стороннем официальном репозитории Python были обнаружены вредоносные пакеты",
    "VK открывает набор на бесплатные курсы по ручному тестированию и углублённому Python",
    "Прокачаться в асинхронном программировании на Python за 6 недель",
    "Что нового в Python за март — обсуждаем в прямом эфире",
    "Что нового в Python за апрель — обсуждаем в прямом эфире",
    "Начните учиться бесплатно на курсе «Python для анализа данных» в Яндекс Практикуме",
    "Вместе с командой Python Google уволила команды Flutter и Dart",
    "Что нового в Python за июнь — обсуждаем в прямом эфире",
    "Открытый вебинар «The Python Packaging»",
    "Intel оптимизировала библиотеку Numpy под AVX-512, ускорив вычисления Python в 14—32 раза",
    "Новый хакатон от СберЗвука для Python-разработчиков",
    "Показываем полезное с Python meetup от Evrone",
    "Показываем доклады прошедшего Python meetup",
    "Библиотеки Ollama Python Library и Ollama JavaScript Library стали доступны на GitHub",
    "Релиз Nuitka 2.0 — компилятора для языка Python",
    "Открытый семинар: FastAPI, или как быстро добавить REST API для вашего проекта на Python",
    "Онлайн-митап от руководителя практики Python Usetech",
    "Бесплатный курс по бэкенд-разработке на Python от наших друзей из KTS",
    "Google дала Bard возможность создавать код на 20 языках, включая C++, Go, Java, Javascript, Python, Typescript",
    "В альфа выпуск языка программирования Python 3.13.0a6 встроен JIT-компилятор",
    "В ChatGPT стал доступен плагин Code Interpreter, который позволяет запускать Python-код",
    "Много ML и прочие полезности. Анонс Python meetup от Evrone",
    "Python на Хабре",
    "Менеджер версий python",
    "10 приложений для изучения Python на Android-устройствах",
    "Так ли мал Alpine 3.8 Docker для Python 3 runtime",
    "Бинарные модули для Python",
    "Python 3 в Facebook",
    "Асинхронная работа с Tarantool на Python"
]